Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
            <instance name="OCMP7">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP8">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP9">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP10">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP11">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP12">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP13">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP14">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP15">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP16">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
         </module>
         <module id="00815" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_pb1_std" name="PCACHE" name-in-module="PCACHE" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02481" name="RPOR" version="">
            <instance name="RPOR">
               <register-group address-space="periph_pb1_std" name="RPOR" name-in-module="RPOR" offset="0x1f801600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx" name="SB" name-in-module="SB" offset="0x1f8f0510" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f827000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2"/>
            <instance name="SPI3"/>
            <instance name="SPI4"/>
            <instance name="SPI5"/>
            <instance name="SPI6"/>
         </module>
