Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
         <register caption="ADC Base Register" name="ADCBASE" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ADCBASE" />
         </register>
         <register caption="ADC DMA Status Register" name="ADCDSTAT" offset="0x310" rw="RW" size="4">
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC0" mask="0x00000001" name="RAF0" values="ADCDSTAT__RAF0" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC1" mask="0x00000002" name="RAF1" values="ADCDSTAT__RAF1" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC2" mask="0x00000004" name="RAF2" values="ADCDSTAT__RAF2" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC3" mask="0x00000008" name="RAF3" values="ADCDSTAT__RAF3" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC4" mask="0x00000010" name="RAF4" values="ADCDSTAT__RAF4" />
            <bitfield caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC5" mask="0x00000020" name="RAF5" values="ADCDSTAT__RAF5" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC0" mask="0x00000100" name="RAFIEN0" values="ADCDSTAT__RAFIEN0" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC1" mask="0x00000200" name="RAFIEN1" values="ADCDSTAT__RAFIEN1" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC2" mask="0x00000400" name="RAFIEN2" values="ADCDSTAT__RAFIEN2" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC3" mask="0x00000800" name="RAFIEN3" values="ADCDSTAT__RAFIEN3" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC4" mask="0x00001000" name="RAFIEN4" values="ADCDSTAT__RAFIEN4" />
            <bitfield caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC5" mask="0x00002000" name="RAFIEN5" values="ADCDSTAT__RAFIEN5" />
            <bitfield mask="0x00008000" name="DMACEN" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC0" mask="0x00010000" name="RBF0" values="ADCDSTAT__RBF0" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC1" mask="0x00020000" name="RBF1" values="ADCDSTAT__RBF1" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC2" mask="0x00040000" name="RBF2" values="ADCDSTAT__RBF2" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC3" mask="0x00080000" name="RBF3" values="ADCDSTAT__RBF3" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC4" mask="0x00100000" name="RBF4" values="ADCDSTAT__RBF4" />
            <bitfield caption="RAM DMA Buffer B Full Status bits for ADC5" mask="0x00200000" name="RBF5" values="ADCDSTAT__RBF5" />
            <bitfield mask="0x00800000" name="WOVERR" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC0" mask="0x01000000" name="RBFIEN0" values="ADCDSTAT__RBFIEN0" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC1" mask="0x02000000" name="RBFIEN1" values="ADCDSTAT__RBFIEN1" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC2" mask="0x04000000" name="RBFIEN2" values="ADCDSTAT__RBFIEN2" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC3" mask="0x08000000" name="RBFIEN3" values="ADCDSTAT__RBFIEN3" />
            <bitfield caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC4" mask="0x10000000" name="RBFIEN4" values="ADCDSTAT__RBFIEN4" />
            <bitfield mask="0x20000000" name="RBFIEN5" />
            <bitfield caption="Global ADC DMA Enable bit" mask="0x80000000" name="DMAEN" values="ADCDSTAT__DMAEN" />
         </register>
         <register caption="ADC Channel Sample Count Base Address Register" name="ADCCNTB" offset="0x320" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCNTB" />
         </register>
         <register caption="ADC Channel Sample Count Base Address Register" name="ADCDMAB" offset="0x330" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCDMAB" />
         </register>
         <register caption="ADC Trigger Level/Edge Sensitivity Register" name="ADCTRGSNS" offset="0x340" rw="RW" size="4">
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000001" name="LVL0" values="ADCTRGSNS__LVL0" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000002" name="LVL1" values="ADCTRGSNS__LVL1" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000004" name="LVL2" values="ADCTRGSNS__LVL2" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000008" name="LVL3" values="ADCTRGSNS__LVL3" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000010" name="LVL4" values="ADCTRGSNS__LVL4" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000020" name="LVL5" values="ADCTRGSNS__LVL5" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000040" name="LVL6" values="ADCTRGSNS__LVL6" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000080" name="LVL7" values="ADCTRGSNS__LVL7" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000100" name="LVL8" values="ADCTRGSNS__LVL8" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000200" name="LVL9" values="ADCTRGSNS__LVL9" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000400" name="LVL10" values="ADCTRGSNS__LVL10" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00000800" name="LVL11" values="ADCTRGSNS__LVL11" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00001000" name="LVL12" values="ADCTRGSNS__LVL12" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00002000" name="LVL13" values="ADCTRGSNS__LVL13" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00004000" name="LVL14" values="ADCTRGSNS__LVL14" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00008000" name="LVL15" values="ADCTRGSNS__LVL15" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00010000" name="LVL16" values="ADCTRGSNS__LVL16" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00020000" name="LVL17" values="ADCTRGSNS__LVL17" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00040000" name="LVL18" values="ADCTRGSNS__LVL18" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x00080000" name="LVL19" values="ADCTRGSNS__LVL19" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x01000000" name="LVL24" values="ADCTRGSNS__LVL24" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x02000000" name="LVL25" values="ADCTRGSNS__LVL25" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x04000000" name="LVL26" values="ADCTRGSNS__LVL26" />
            <bitfield caption="Trigger Level and Edge Sensitivity bits" mask="0x08000000" name="LVL27" values="ADCTRGSNS__LVL27" />
         </register>
