Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL7">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL8">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL9">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL10">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL11">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL12">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL13">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL14">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL15">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL16">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL17">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL18">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL19">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL24">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL25">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL26">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
