Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
         <register caption="CDAC Control Register" name="DAC2CON" offset="0x20200" rw="RW" size="4">
            <bitfield caption="Reference Source Select bits" mask="0x00000003" name="REFSEL" values="DAC2CON__REFSEL" />
            <bitfield caption="CDAC Output Buffer Enable bit" mask="0x00000100" name="DACOE" values="DAC2CON__DACOE" />
            <bitfield caption="CDAC Enable bit" mask="0x00008000" name="ON" values="DAC2CON__ON" />
            <bitfield mask="0xFFFF0000" name="DACDAT" />
         </register>
         <register caption="CDAC Control Register" name="DAC3CON" offset="0x20400" rw="RW" size="4">
            <bitfield caption="Reference Source Select bits" mask="0x00000003" name="REFSEL" values="DAC3CON__REFSEL" />
            <bitfield caption="CDAC Output Buffer Enable bit" mask="0x00000100" name="DACOE" values="DAC3CON__DACOE" />
            <bitfield caption="CDAC Enable bit" mask="0x00008000" name="ON" values="DAC3CON__ON" />
            <bitfield mask="0xFFFF0000" name="DACDAT" />
         </register>
      </register-group>
      <value-group caption="Reference Source Select bits" name="DAC1CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x2" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x1" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC1CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC1CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Source Select bits" name="DAC2CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x2" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x1" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC2CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC2CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Source Select bits" name="DAC3CON__REFSEL">
         <value caption="Positive reference voltage = AVDD" name="" value="0x3" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x2" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x1" />
         <value caption="No reference selected (no reference current consumption)" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC3CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC3CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02481" name="CFG" version="">
      <register-group name="CFG">
         <register caption="Configuration Control Register" name="CFGCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN" />
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="CFGCON__TROEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN" />
            <bitfield caption="I/O Analog Charge Pump Enable bit" mask="0x00000080" name="IOANCPEN" values="CFGCON__IOANCPEN" />
            <bitfield caption="Permission Group Lock bit" mask="0x00000800" name="PGLOCK" values="CFGCON__PGLOCK" />
            <bitfield caption="Peripheral Module Disable bit" mask="0x00001000" name="PMDLOCK" values="CFGCON__PMDLOCK" />
            <bitfield caption="Peripheral Pin Select Lock bit(" mask="0x00002000" name="IOLOCK" values="CFGCON__IOLOCK" />
            <bitfield caption="Output Compare Alternate Clock Selection bit" mask="0x00010000" name="OCACLK" values="CFGCON__OCACLK" />
            <bitfield caption="Input Capture Alternate Clock Selection bit" mask="0x00020000" name="ICACLK" values="CFGCON__ICACLK" />
            <bitfield caption="ADC Arbitration Priority to SRAM bit" mask="0x04000000" name="ADCPRI" values="CFGCON__ADCPRI" />
         </register>
         <register caption="Device and Revision ID Register" name="DEVID" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID" />
            <bitfield mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
         <register caption="" name="PMD1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCMD" />
            <bitfield mask="0x00000010" name="DAC1MD" />
            <bitfield mask="0x00000020" name="DAC2MD" />
            <bitfield mask="0x00000040" name="DAC3MD" />
            <bitfield mask="0x00000100" name="CTMUMD" />
            <bitfield mask="0x00000200" name="EEMD" />
            <bitfield mask="0x00100000" name="HLVDMD" />
         </register>
         <register caption="" name="PMD2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1MD" />
            <bitfield mask="0x00000002" name="CMP2MD" />
            <bitfield mask="0x00000004" name="CMP3MD" />
            <bitfield mask="0x00000008" name="CMP4MD" />
            <bitfield mask="0x00000010" name="CMP5MD" />
            <bitfield mask="0x00010000" name="OPA1MD" />
            <bitfield mask="0x00020000" name="OPA2MD" />
            <bitfield mask="0x00040000" name="OPA3MD" />
            <bitfield mask="0x00100000" name="OPA5MD" />
         </register>
