Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="SR1B4" />
            <bitfield mask="0x00000040" name="SR1B6" />
            <bitfield mask="0x00000080" name="SR1B7" />
            <bitfield mask="0x00000400" name="SR1B10" />
            <bitfield mask="0x00000800" name="SR1B11" />
            <bitfield mask="0x00001000" name="SR1B12" />
            <bitfield mask="0x00002000" name="SR1B13" />
            <bitfield mask="0x00004000" name="SR1B14" />
            <bitfield mask="0x00008000" name="SR1B15" />
         </register>
         <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000040" name="SR1C6" />
            <bitfield mask="0x00000080" name="SR1C7" />
            <bitfield mask="0x00000100" name="SR1C8" />
            <bitfield mask="0x00000200" name="SR1C9" />
            <bitfield mask="0x00000800" name="SR1C11" />
            <bitfield mask="0x00008000" name="SR1C15" />
         </register>
         <register caption="" name="SRCON1D" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000020" name="SR1D5" />
            <bitfield mask="0x00000040" name="SR1D6" />
            <bitfield mask="0x00000100" name="SR1D8" />
         </register>
         <register caption="" name="SRCON1E" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00001000" name="SR1E12" />
            <bitfield mask="0x00002000" name="SR1E13" />
            <bitfield mask="0x00004000" name="SR1E14" />
            <bitfield mask="0x00008000" name="SR1E15" />
         </register>
         <register caption="" name="SRCON1F" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1F0" />
            <bitfield mask="0x00000002" name="SR1F1" />
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00740" name="ICAP" version="1">
      <register-group name="ICAP">
         <register caption="Input Capture x Control Register" name="IC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC1CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC1CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC1CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC1CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC1CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC1CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC1CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC1CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC1CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC2CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC2CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC2CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC2CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC2CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC2CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC2CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC2CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC2CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC3CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC3CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC3CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC3CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC3CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC3CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC3CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC3CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC3CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC4CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC4CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC4CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC4CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC4CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC4CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC4CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC4CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC4CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC5CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC5CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC5CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC5CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC5CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC5CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC5CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC5CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC5CON__ON" />
         </register>
