Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC16CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC16CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC16CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC16CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC16CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC16CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC16CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC16CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02481" name="INT" version="3">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge Polarity Control bit" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield mask="0x00FF0000" name="NMIKEY" />
         </register>
         <register caption="Priority Shadow Select Register" name="PRISS" offset="0x10" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits" mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS" />
            <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits" mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS" />
            <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits" mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS" />
            <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits" mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS" />
            <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits" mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits" mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS" />
            <bitfield caption="Interrupt with Priority Level 7 Shadow Set bits" mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS" />
         </register>
         <register caption="Interrupt Status Register" name="INTSTAT" offset="0x20" rw="R" size="4">
            <bitfield mask="0x000000FF" name="SIRQ" />
            <bitfield caption="Requested Priority Level bits for Single Vector Mode bits" mask="0x00000700" name="SRIPL" values="INTSTAT__SRIPL" />
         </register>
         <register caption="Interrupt Proximity Timer Register" name="IPTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1EIF" />
            <bitfield mask="0x00000040" name="IC1IF" />
            <bitfield mask="0x00000080" name="OC1IF" />
            <bitfield mask="0x00000100" name="INT1IF" />
            <bitfield mask="0x00000200" name="T2IF" />
            <bitfield mask="0x00000400" name="IC2EIF" />
            <bitfield mask="0x00000800" name="IC2IF" />
            <bitfield mask="0x00001000" name="OC2IF" />
            <bitfield mask="0x00002000" name="INT2IF" />
            <bitfield mask="0x00004000" name="T3IF" />
            <bitfield mask="0x00008000" name="IC3EIF" />
            <bitfield mask="0x00010000" name="IC3IF" />
            <bitfield mask="0x00020000" name="OC3IF" />
            <bitfield mask="0x00040000" name="INT3IF" />
            <bitfield mask="0x00080000" name="T4IF" />
            <bitfield mask="0x00100000" name="IC4EIF" />
            <bitfield mask="0x00200000" name="IC4IF" />
            <bitfield mask="0x00400000" name="OC4IF" />
            <bitfield mask="0x00800000" name="INT4IF" />
            <bitfield mask="0x01000000" name="T5IF" />
            <bitfield mask="0x02000000" name="IC5EIF" />
            <bitfield mask="0x04000000" name="IC5IF" />
            <bitfield mask="0x08000000" name="OC5IF" />
            <bitfield mask="0x40000000" name="RTCCIF" />
            <bitfield mask="0x80000000" name="FCEIF" />
         </register>
         <register caption="Interrupt Flag Status Register " name="IFS1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IF" />
            <bitfield mask="0x00000002" name="CMP2IF" />
            <bitfield mask="0x00000004" name="USB1IF" />
            <bitfield mask="0x00000008" name="SPI1EIF" />
            <bitfield mask="0x00000010" name="SPI1RXIF" />
            <bitfield mask="0x00000020" name="SPI1TXIF" />
            <bitfield mask="0x00000040" name="U1EIF" />
            <bitfield mask="0x00000080" name="U1RXIF" />
            <bitfield mask="0x00000100" name="U1TXIF" />
            <bitfield mask="0x00000200" name="I2C1BIF" />
            <bitfield mask="0x00000400" name="I2C1SIF" />
            <bitfield mask="0x00000800" name="I2C1MIF" />
            <bitfield mask="0x00001000" name="CNAIF" />
            <bitfield mask="0x00002000" name="CNBIF" />
            <bitfield mask="0x00004000" name="CNCIF" />
            <bitfield mask="0x00008000" name="CNDIF" />
            <bitfield mask="0x00010000" name="CNEIF" />
            <bitfield mask="0x00020000" name="CNFIF" />
            <bitfield mask="0x00040000" name="CNGIF" />
            <bitfield mask="0x00080000" name="PMPIF" />
            <bitfield mask="0x00100000" name="PMPEIF" />
            <bitfield mask="0x00200000" name="SPI2EIF" />
            <bitfield mask="0x00400000" name="SPI2RXIF" />
            <bitfield mask="0x00800000" name="SPI2TXIF" />
            <bitfield mask="0x01000000" name="U2EIF" />
            <bitfield mask="0x02000000" name="U2RXIF" />
            <bitfield mask="0x04000000" name="U2TXIF" />
            <bitfield mask="0x08000000" name="I2C2BIF" />
            <bitfield mask="0x10000000" name="I2C2SIF" />
            <bitfield mask="0x20000000" name="I2C2MIF" />
            <bitfield mask="0x40000000" name="U3EIF" />
            <bitfield mask="0x80000000" name="U3RXIF" />
         </register>
