Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK0512GPD064.atdf
         <register caption="" name="SDI4R" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI4R" />
         </register>
         <register caption="" name="SS4R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS4R" />
         </register>
         <register caption="" name="C1RXR" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C1RXR" />
         </register>
         <register caption="" name="C2RXR" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C2RXR" />
         </register>
         <register caption="" name="REFIR" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFIR" />
         </register>
         <register caption="" name="IC10R" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC10R" />
         </register>
         <register caption="" name="IC11R" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC11R" />
         </register>
         <register caption="" name="IC12R" offset="0xfc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC12R" />
         </register>
         <register caption="" name="IC13R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC13R" />
         </register>
         <register caption="" name="IC14R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC14R" />
         </register>
         <register caption="" name="IC15R" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC15R" />
         </register>
         <register caption="" name="IC16R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC16R" />
         </register>
         <register caption="" name="SCK5R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK5R" />
         </register>
         <register caption="" name="SDI5R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI5R" />
         </register>
         <register caption="" name="SS5R" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS5R" />
         </register>
         <register caption="" name="SCK6R" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK6R" />
         </register>
         <register caption="" name="SDI6R" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI6R" />
         </register>
         <register caption="" name="SS6R" offset="0x124" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS6R" />
         </register>
         <register caption="" name="C3RXR" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C3RXR" />
         </register>
         <register caption="" name="C4RXR" offset="0x12c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C4RXR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02481" name="RPOR" version="">
      <register-group name="RPOR">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA4R" />
         </register>
         <register caption="" name="RPA7R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA7R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA8R" />
         </register>
         <register caption="" name="RPA11R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA11R" />
         </register>
         <register caption="" name="RPA12R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA12R" />
         </register>
         <register caption="" name="RPA14R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA14R" />
         </register>
         <register caption="" name="RPA15R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA15R" />
         </register>
         <register caption="" name="RPB0R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB0R" />
         </register>
         <register caption="" name="RPB1R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB1R" />
         </register>
         <register caption="" name="RPB2R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB3R" />
         </register>
         <register caption="" name="RPB4R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB4R" />
         </register>
         <register caption="" name="RPB5R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB7R" />
         </register>
         <register caption="" name="RPB9R" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB9R" />
         </register>
